# AnyPatternIdParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnyPatternIdParam Property
ParameterTypeId Class See Also
---
"Fill Pattern"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnyPatternIdParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnyPatternIdParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnyPatternIdParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace